Revit 2023 API
IndependentTag.HasLeader Property
 Identifies if a tag has at least one visible leader, or if all leaders are hidden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public bool HasLeader { get; set; }
Visual Basic
Public Property HasLeader As Boolean
	Get
	Set
Visual C++
public:
property bool HasLeader {
	bool get ();
	void set (bool value);
}
Field Value
 True if at least one leader is visible, false if all leaders are hidden. Setting the property to true, it will make all leaders visible.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: For this tag leaders are not allowed.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace